In [44]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [45]:
n = ['Anwar' , 'Sara' , 'Nourah']
i = [1,2,3]
s = pd.Series(n,i)
s

1     Anwar
2      Sara
3    Nourah
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [46]:
s.index=[11,12,13]
s

11     Anwar
12      Sara
13    Nourah
dtype: object

## Q3: Retrieve First and second elements.

In [47]:
print('The first element',s[11])
print('The second element',s[12])

The first element Anwar
The second element Sara

## Q4: Add duplicate elements, then remove the duplication.

In [50]:
n = pd.Series(['Sara','Anwar'])
s = pd.concat([s, n],ignore_index=True)
s

0     Anwar
1      Sara
2    Nourah
3      Sara
4     Anwar
dtype: object

In [51]:
s = s.drop_duplicates()
s

0     Anwar
1      Sara
2    Nourah
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [54]:
df = pd.DataFrame(columns=['ID', 'Name', 'GPA'])
df

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [24]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [66]:
#Changed the index to show the difference
edu.index = pd.RangeIndex(90,90 + len(edu))
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
91,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
92,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
93,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
94,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
469,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
470,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
471,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
472,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
473,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [67]:
edu.loc[90:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
91,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
92,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
93,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
94,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [68]:
edu[90:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
180,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
181,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
182,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
183,2009,Belgium,Total public expenditure on education as % of ...,6.57,d